# encoding: utf-8
# language: ru

Функционал: Сложение двух чисел
	Как Кассир
	Хочу Складывать два числа
	Чтобы Экономить на калькуляторах

Сценарий: Сложение двух чисел 5 и 20.5
	Допустим У меня есть первое слагаемое равное 5
	И У меня есть второе слагаемое равное 20.5
	Тогда Результат сложения равен 25.5

Сценарий: Сложение двух чисел 12 и 40
	Допустим У меня есть первое слагаемое равное 12
	И У меня есть второе слагаемое равное 40
	Тогда Результат сложения равен 52

Сценарий: Умножение двух чисел 3 и 11
	Допустим У меня есть первый множитель равный 3
	И У меня есть Второй множитель равный 11
	Тогда Результат умножения равен 33
