
// Сформировать печатные формы объектов.
//
// ВХОДЯЩИЕ:
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
//   ОшибкиПечати          - Список значений  - Ошибки печати  (значение - ссылка на объект, представление - текст
//                           ошибки).
//   ОбъектыПечати         - Список значений  - Объекты печати (значение - ссылка на объект, представление - имя
//                           области в которой был выведен объект).
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "bn_ТрудовойДоговор") Тогда //TODO: передать из настроек нужной ПФ
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"bn_ТрудовойДоговор", НСтр("ru = 'Трудовой договор (настраиваемый)'"), //TODO: передать из настроек нужной ПФ
			ТабличныйДокументТрудовогоДоговора(ПолучитьМакет("bn_ШаблонТрудовогоДоговора"), МассивОбъектов, ОбъектыПечати), ,
			"Обработка.bn_ПечатьТрудовогоДоговора.bn_ШаблонТрудовогоДоговора");
	КонецЕсли;
	
КонецПроцедуры

Функция ТабличныйДокументТрудовогоДоговора(Макет, МассивОбъектов, ОбъектыПечати)
	
	ТабДокумент = Новый ТабличныйДокумент;
	
	Возврат ТабДокумент;
	
КонецФункции
